---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpacingRule
source: html/b076c6a9-d929-e67a-ff2f-0975e9aacc09.htm
---
# SpacingRule Methods

Causes the object to release immediately any resources it may be utilizing.